Revit 2024 API
MEPNetworkSegmentId Constructor (ElementId, Int32)
 Creates a valid segment id on the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPNetworkSegmentId(
	ElementId idElem,
	int segment
)
Visual Basic
Public Sub New ( _
	idElem As ElementId, _
	segment As Integer _
)
Visual C++
public:
MEPNetworkSegmentId(
	ElementId^ idElem,
	int segment
)
Parameters
idElem
Type: Autodesk.Revit.DB.ElementId
segment
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPNetworkSegmentId Class
MEPNetworkSegmentId Overload
Autodesk.Revit.DB.Analysis Namespace